Set the custom data real value for the specified custom data.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public void SetPartCustomDataText(
	int customId,
	string value
)
  Visual Basic
Public Sub SetPartCustomDataText ( _
	customId As Integer, _
	value As String _
)
  Visual C++
public:
void SetPartCustomDataText(
	int customId,
	String^ value
)
 Parameters
  customId
 Type:  System Int32
 The identifier of the custom data field to set.
  value
 Type:  System String
 The text value of the custom data. If the data is not a text type the value will be parsed according to the fabrication confifuration rules.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  FabricationPart Class
  Autodesk.Revit.DB Namespace